<a href="https://colab.research.google.com/github/seungm2n/PythonTest/blob/main/Python_Numpy%EC%99%80_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas       # 판다스는 pandas 라이브러리를 임포트해야 사용 가능

In [ ]:
import pandas as pd   # as를 사용하면 불러온 라이브러리 이름을 별도로 지정가능

In [ ]:
pd.read_csv('sample.csv')

    Var_1  Var_2
0       1      2
1       3      4
2       2      5
3       5      6
4       3      2
5       1      1
6       2      6
7       5      7
8       6      8
9       7      4
10      7      7
11      8      3
12      9      7
13      3      9
14      2      2
15      1      3
16      2      6
17      2      4
18      3      3

In [ ]:
sample = pd.read_csv('sample.csv')

In [ ]:
sample.head()

   Var_1  Var_2
0      1      2
1      3      4
2      2      5
3      5      6
4      3      2

In [ ]:
sample.head(3)

   Var_1  Var_2
0      1      2
1      3      4
2      2      5

In [ ]:
sample.tail()

    Var_1  Var_2
14      2      2
15      1      3
16      2      6
17      2      4
18      3      3

In [ ]:
sample.tail(10)

    Var_1  Var_2
9       7      4
10      7      7
11      8      3
12      9      7
13      3      9
14      2      2
15      1      3
16      2      6
17      2      4
18      3      3

In [ ]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Var_1   19 non-null     int64
 1   Var_2   19 non-null     int64
dtypes: int64(2)
memory usage: 432.0 bytes

In [ ]:
sample.describe()

           Var_1      Var_2
count  19.000000  19.000000
mean    3.789474   4.684211
std     2.529360   2.310667
min     1.000000   1.000000
25%     2.000000   3.000000
50%     3.000000   4.000000
75%     5.500000   6.500000
max     9.000000   9.000000

In [ ]:
sample_dic = {'name' : ['John', 'Ann', 'Kevin'], 'age' : [23, 22, 21]}  #딕셔너리
sample_dic = pd.DataFrame(sample_dic)    #판다스의 DataFrame()함수 안에 넣어줌

In [ ]:
sample_dic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [ ]:
sample_dic

    name  age
0   John   23
1    Ann   22
2  Kevin   21

NameError: name 'data' is not defined